Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/**
 * @brief Check if we should send a deferred "ok" response
 *
 * Two-phase release strategy:
 *
 * Phase A — gcode queue still has commands (q->count > 0):
 *   Release ONE deferred ok each time the gcode queue count DECREASES (a
 *   command was consumed and dispatched to the trajectory planner).
 *   prev_count ensures exactly one ok per consumed slot regardless of how
 *   many times this function is called per iteration.
 *
 * Phase B — gcode queue fully drained (q->count == 0):
 *   Hold ALL remaining deferred oks until physical motion is completely done:
 *     - trajectory queue empty  (motionQueueCount == 0)
 *     - arc generation finished (arcGenState == ARC_GEN_IDLE)
 *   Then flush every remaining pending ok in one burst.
 *
 * This guarantees UGS cannot receive its final ok(s) while stepper motion
 * is still executing, regardless of how many trajectory segments an arc or
 * a dense section of linear moves generates.
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    // Use the monotonically-increasing commands_consumed counter to determine
    // how many OKs to release.  This is correct even when new commands arrive
    // simultaneously (which makes the raw q->count delta unreliable — the
    // depth can stay flat while commands flow through, starving UGS).
    static uint32_t prev_consumed = 0;
    uint32_t curr_consumed = q->commands_consumed;

    // Do NOT release deferred oks while a G4 dwell is in progress.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    if (okPendingCount == 0) {
        // Nothing to release — keep prev_consumed in sync so we don't get a
        // spurious burst (uint32 wraparound) when commands_consumed is reset
        // on soft-reset but prev_consumed still holds the old value.
        prev_consumed = curr_consumed;
        return;
    }

    if (curr_consumed != prev_consumed) {
        // Commands were consumed since last check — release one ok per command.
        uint32_t consumed = curr_consumed - prev_consumed; // wraps safely (uint32)
        prev_consumed = curr_consumed;
        while (consumed > 0 && okPendingCount > 0) {
            if (!UART_SendOK()) break;
            DEBUG_PRINT_GCODE("[DEFERRED] Command consumed, sent ok (pending=%lu)\r\n",
                              (unsigned long)(okPendingCount - 1));
            okPendingCount--;
            consumed--;
        }
    } else if (q->count == 0 && okPendingCount > 0) {
        // Queue drained to zero with no new consumption detected this call.
        // Flush remaining so UGS is never permanently blocked on the last batch.
        DEBUG_PRINT_GCODE("[DEFERRED] Queue empty — flushing %lu remaining oks\r\n",
                          (unsigned long)okPendingCount);
        while (okPendingCount > 0) {
            if (!UART_SendOK()) break;
            okPendingCount--;
        }
    }
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 *
 * Gates purely on gcode command queue depth:
 *   >= HIGH_WATER → defer (stop filling UGS send window)
 *   <  HIGH_WATER → send immediately (keep UGS pushing commands)
 *
 * The trajectory planner queue is managed independently (MOTION_Arc backs
 * off at 62/64) — it does NOT gate UGS flow here.
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // While a G4 dwell is active, always defer.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    // Gate purely on gcode queue depth: one ok per one accepted command.
    if (q->count >= GCODE_QUEUE_HIGH_WATER) {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (gcodeQ=%lu >= HIGH=%d, pending=%lu)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (gcodeQ=%lu < HIGH=%d)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER);
        (void)UART_SendOK();
    }
}

/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

    // ✅ CRITICAL: Check deferred "ok" ONCE at entry using FRESH count
    // If buffer drained and okPending, send "ok" immediately then continue processing
    GCODE_CheckDeferredOk(appData, cmdQueue);

    switch (gcodeData.state)
    {
    case GCODE_STATE_IDLE:
        nBytesAvailable = UART3_ReadCountGet();
        if (nBytesAvailable > 0) {
            uint32_t space = (uint32_t)(sizeof(rxBuffer) - 1U - nBytesRead);
            if (space > 0U) {
                uint32_t toRead = (nBytesAvailable < space) ? nBytesAvailable : space;
                uint32_t got = UART3_Read(&rxBuffer[nBytesRead], toRead);
                nBytesRead += got;
                rxBuffer[nBytesRead] = '\0';
            }
        }

        if (nBytesRead == 0) {
            break;  // No data in buffer, exit IDLE state
        }

        /* Literal "0x18" typed by user */
        if (nBytesRead >= 4 &&
            rxBuffer[0] == '0' && rxBuffer[1] == 'x' &&
            rxBuffer[2] == '1' && rxBuffer[3] == '8') {
            GCODE_SoftReset(appData, cmdQueue);
            break;
        }

        if (is_control_char(rxBuffer[0])) {
            gcodeData.state = GCODE_STATE_CONTROL_CHAR;
        } else {
            bool has_terminator = false;
            uint32_t terminator_pos = 0;
            for (uint32_t i = 0; i < nBytesRead; i++) {
                if (rxBuffer[i] == '\n' || rxBuffer[i] == '\r') {
                    has_terminator = true;
                    terminator_pos = i;
                    break;
                }
            }
            if (!has_terminator) break;
            rxBuffer[terminator_pos] = '\0';

