Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
            // Report last probe result (contact position + triggered flag)
            p += snprintf(&buf[p], sizeof(buf)-p, "[PRB:%.3f,%.3f,%.3f:%d]\r\n",
                (double)appData->probePosition.coordinate[AXIS_X],
                (double)appData->probePosition.coordinate[AXIS_Y],
                (double)appData->probePosition.coordinate[AXIS_Z],
                appData->probeSuccess ? 1 : 0);
            
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'G') {
            char state_buffer[160];
            int l = 0;
            l += sprintf(&state_buffer[l], "[GC:");
            l += sprintf(&state_buffer[l], "G0 ");
            l += sprintf(&state_buffer[l], "G%d ", 54 + appData->activeWCS);  // Dynamic WCS (G54-G59)
            l += sprintf(&state_buffer[l], "G%d ", appData->modalPlane == 0 ? 17 : (appData->modalPlane == 1 ? 18 : 19));
            l += sprintf(&state_buffer[l], "%s ", unitsInches ? "G20" : "G21");
            l += sprintf(&state_buffer[l], "G%d ", appData->absoluteMode ? 90 : 91);
            l += sprintf(&state_buffer[l], "G94 ");
            // Tool length offset modal state (G43 if active, G49 if cancelled)
            { bool tlo_on = false; KINEMATICS_GetTLO(&tlo_on);
              l += sprintf(&state_buffer[l], "%s ", tlo_on ? "G43" : "G49"); }
            l += sprintf(&state_buffer[l], "M5 ");
            l += sprintf(&state_buffer[l], "M9 ");
            l += sprintf(&state_buffer[l], "T%lu ", (unsigned long)appData->modalToolNumber);
            // ✅ FIX: Use integer cast to avoid float/double ABI mismatch in sprintf
            l += sprintf(&state_buffer[l], "F%lu ", (unsigned long)(uint32_t)(appData->modalFeedrate + 0.5f));
            l += sprintf(&state_buffer[l], "S%lu", (unsigned long)appData->modalSpindleRPM);
            l += sprintf(&state_buffer[l], "]\r\n");
            UART3_Write((uint8_t*)state_buffer, (uint32_t)l);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'H') {
            // $H - Homing cycle command
            // Create homing event and add to command queue
            if (cmdQueue->count < GCODE_MAX_COMMANDS) {
                strcpy(cmdQueue->commands[cmdQueue->head].command, "$H");
                cmdQueue->head = (cmdQueue->head + 1) % GCODE_MAX_COMMANDS;
                cmdQueue->count++;
            }
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'L') {
            // $L - Debug command: Show limit switch states
            CNC_Settings* settings = SETTINGS_GetCurrent();
            
            DEBUG_PRINT_GCODE("[LIMIT] Pins: X_Min=%d X_Max=%d Y_Min=%d Y_Max=%d Z_Min=%d Z_Max=%d A_Min=%d A_Max=%d\r\n",
                             LIMIT_GetMin(AXIS_X), LIMIT_GetMax(AXIS_X),
                             LIMIT_GetMin(AXIS_Y), LIMIT_GetMax(AXIS_Y),
                             LIMIT_GetMin(AXIS_Z), LIMIT_GetMax(AXIS_Z),
                             LIMIT_GetMin(AXIS_A), LIMIT_GetMax(AXIS_A));
            
            DEBUG_PRINT_GCODE("[LIMIT] Settings: $5=%u $21=%u (%s)\r\n", 
                             settings->limit_pins_invert,
                             settings->hard_limits_enable,
                             settings->hard_limits_enable ? "ENABLED" : "DISABLED");
            
            // Show which axes would trigger alarm
            bool any_triggered = false;
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                bool triggered = LIMIT_CheckAxis(axis, settings->limit_pins_invert);
                if (triggered) {
                    DEBUG_EXEC_GCODE({
                        char axis_name = 'X' + axis;
                        DEBUG_PRINT_GCODE("[LIMIT] *** AXIS %c TRIGGERED ***\r\n", axis_name);
                    });
                    any_triggered = true;
                }
            }
            if (!any_triggered) {
                DEBUG_PRINT_GCODE("[LIMIT] All clear - no limits triggered\r\n");
            }
            
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'I') {
            SETTINGS_PrintBuildInfo();
            handled = true;
            send_ok = false;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'N') {
            char buf[160];
            int p = 0;
            p += snprintf(&buf[p], sizeof(buf)-p, "[N0:%s]\r\n", startupLines[0]);
            p += snprintf(&buf[p], sizeof(buf)-p, "[N1:%s]\r\n", startupLines[1]);
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'C') {
            grblCheckMode = !grblCheckMode;
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'X') {
            grblAlarm = false;
            
            // ✅ Clear hard limit alarm flag (set by stepper ISR)
            // g_hard_limit_alarm declared in stepper.h (already included at top)
            g_hard_limit_alarm = false;
            
            // ✅ CRITICAL FIX: Clear hard limit suppression flag
            // This allows recovery after moving off limit switch
            // User must physically move off limit before $X will work
            CNC_Settings* settings = SETTINGS_GetCurrent();
            if (!MOTION_UTILS_CheckHardLimits(settings->limit_pins_invert)) {
                // Limits are clear - allow recovery
                g_suppress_hard_limits = false;
                DEBUG_PRINT_GCODE("[GCODE] Alarm cleared via $X - limits clear, recovery allowed\r\n");
            } else {
                // Still on limit - cannot clear alarm
                UART_Printf("[MSG:Cannot clear alarm - move off limit switch first]\r\n");
                g_hard_limit_alarm = true;  // Keep alarm active
                grblAlarm = true;
                send_ok = false;  // Don't send ok for failed $X
            }
            
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'F') {
            UART3_Write((uint8_t*)"[F:100|S:100]\r\n", 15);
            handled = true;
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'R' && cmd[2] == 'S' && cmd[3] == 'T' && cmd[4] == '=') {
            char target = cmd[5];
            if (target == '*') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
                grblAlarm = false;
            } else if (target == '$') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
            } else if (target == '#') {
                WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
                for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                    SET_COORDINATE_AXIS(&wcs->offset, axis, 0.0f);
                }
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
            }
            handled = true;
        }
        else if (len >= 4 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'L' && cmd[3] == 'P') {
            UART3_Write((uint8_t*)"error:2\r\n", 10);
            send_ok = false;
            handled = true;
        }
        else if (cmd[0] == '$' && isdigit((unsigned char)cmd[1])) {
            char* pend;
            long param = strtol(&cmd[1], &pend, 10);
            if (param < 0) {
                UART3_Write((uint8_t*)"error:3\r\n", 10);
                send_ok = false;
                handled = true;
            } else if (*pend == '=') {
                float val = strtof(pend + 1, NULL);
                CNC_Settings* s = SETTINGS_GetCurrent();
                if (SETTINGS_SetValue(s, (uint32_t)param, val)) {
                    s->checksum = SETTINGS_CalculateCRC32(s);
                    
                    // ✅ Save to flash immediately so setting persists across resets
                    SETTINGS_SaveToFlash(s);
                    
                    // Reload stepper cached settings if step/dir/enable invert changed ($0-$5)
                    if (param <= 5) {
                        STEPPER_ReloadSettings();
                    }

#ifdef HAS_TMC5160_AXIS
                    // Re-apply TMC5160 configuration when motor driver params change ($200-$253)
                    // Parameter layout: $2X0 = axis X, $2X1 = axis Y, $2X2 = Z, $2X3 = A
                    if (param >= 200 && param <= 253) {
                        uint32_t axis_idx = (uint32_t)param % 10;
                        if (axis_idx < (uint32_t)NUM_AXIS) {
                            TMC5160_ApplySettings((E_AXIS)axis_idx, s);
                        }
                    }
#endif
                    
                    handled = true;
                } else {
                    UART3_Write((uint8_t*)"error:3\r\n", 10);
                    send_ok = false;
                    handled = true;
                }
            } else if (*pend == '\0') {
                float val = SETTINGS_GetValue(SETTINGS_GetCurrent(), (uint32_t)param);
                int out = snprintf((char*)txBuffer, sizeof(txBuffer), "$%ld=%g\r\n", param, val);
                UART3_Write(txBuffer, (uint32_t)out);
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'A' && cmd[3] == 'V' && cmd[4] == 'E') {
            // $SAVE - Explicitly save current settings to flash
            CNC_Settings* settings = SETTINGS_GetCurrent();
            if (settings != NULL && SETTINGS_SaveToFlash(settings)) {
                UART3_Write((uint8_t*)"[MSG:Settings saved to flash]\r\n", 33);
            } else {
                UART3_Write((uint8_t*)"error:9\r\n", 10);  // Error 9: Flash write failed
                send_ok = false;
            }
            handled = true;
        }
        else if (len == 1 && cmd[0] == '$') {
            UART3_Write((uint8_t*)"[HLP:$$ $# $G $I $N $C $X $F $RST= $SAVE $SLP $L]\r\n", 53);
            UART3_Write((uint8_t*)"[MSG:$21 Hard Limits Enable - $21=0 (disabled), $21=1 (enabled)]\r\n", 68);
            UART3_Write((uint8_t*)"[MSG:$5 Limit Pin Invert - NO switch:$5=0 (pin HIGH triggers), NC switch:$5=255 (pin LOW triggers)]\r\n", 103);
            UART3_Write((uint8_t*)"[MSG:$L - Show limit switch states (debug)]\r\n", 46);
            handled = true;
        }

